#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.github_repo["roguna"].github_repository.repo: Refreshing state... [id=roguna]
module.github_repo["mefbox"].github_repository.repo: Refreshing state... [id=mefbox]
module.github_repo["anna-helmova"].github_repository.repo: Refreshing state... [id=anna-helmova]
module.github_repo["devops-workshop"].github_repository.repo: Refreshing state... [id=devops-workshop]
module.github_repo["maze"].github_repository.repo: Refreshing state... [id=maze]
module.github_repo["go-cci-trigger"].github_repository.repo: Refreshing state... [id=go-cci-trigger]
module.github_repo["vaclav-dvorak"].github_repository.repo: Refreshing state... [id=vaclav-dvorak]
module.github_repo["summit-pokemon"].github_repository.repo: Refreshing state... [id=summit-pokemon]
module.github_repo["frajer"].github_repository.repo: Refreshing state... [id=frajer]
module.github_repo["vccsturm"].github_repository.repo: Refreshing state... [id=vccsturm]
module.github_repo["game-of-life"].github_repository.repo: Refreshing state... [id=game-of-life]
module.github_repo["fiddo"].github_repository.repo: Refreshing state... [id=fiddo]
module.github_repo["dpd-test"].github_repository.repo: Refreshing state... [id=dpd-test]
module.github_repo["go101"].github_repository.repo: Refreshing state... [id=go101]
module.github_repo["bara"].github_repository.repo: Refreshing state... [id=bara]
module.github_repo["go-api-hello-world"].github_repository.repo: Refreshing state... [id=go-api-hello-world]
module.github_repo["summit-formule"].github_repository.repo: Refreshing state... [id=summit-formule]
module.github_repo["toulky"].github_repository.repo: Refreshing state... [id=toulky]
module.github_repo["wsl-setup"].github_repository.repo: Refreshing state... [id=wsl-setup]
module.github_repo["go-telegram-test"].github_repository.repo: Refreshing state... [id=go-telegram-test]
module.github_repo["apprepo-dash"].github_repository.repo: Refreshing state... [id=apprepo-dash]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github_repo["wsl-setup"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"a8f7fa2ecee122af888cbc55bb0e92060f2d3159ed64c2cc2f534629134b92a3\"" -> "W/\"3327a6295e76df28557715f4a3a25264933425751eb19b33c13f2d2e5e28d27b\""
        id                     = "wsl-setup"
        name                   = "wsl-setup"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["toulky"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"041987c215011faa9df166593ce552cebbaca0d9cd0f8ad7ca177e07f7ef364d\"" -> "W/\"7d3873524cac0f97e919efb94e3a5cf83f9666ee5d2fe90066ed35f626331319\""
        id                     = "toulky"
        name                   = "toulky"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["go101"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"a176f3fcb71403fb27bd7c62190a36898b45c78badab83632c656b3809fc2f7d\"" -> "W/\"0f7f283b81eb0619bed16838ea36dcbfe8a2dd9af729e426f50fc5a1019e83ff\""
        id                     = "go101"
        name                   = "go101"
        # (25 unchanged attributes hidden)
    }
  # module.github_repo["go-telegram-test"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"2bb219bf68d45fb93cb2ff16d300c7934b6f20bfb1945f8d0ac56442046750c5\"" -> "W/\"b4c939182db43d35471ba5864af9e05a69c8bc0a37783fb95ce1e09a2fe36103\""
        id                     = "go-telegram-test"
        name                   = "go-telegram-test"
      + topics                 = []
        # (26 unchanged attributes hidden)
    }
  # module.github_repo["vaclav-dvorak"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"a6d7fb60244256c68bb43e224d22e8937623d94fa45800c6d4eaa218caba290e\"" -> "W/\"20be1cfbc6070bb9f76832165ce828a95a1ee27140f923eeaf7bf5a232e1817b\""
        id                     = "vaclav-dvorak"
        name                   = "vaclav-dvorak"
        # (25 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_repo["go-game-of-life"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Simple implementation of game of life in golang"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-game-of-life"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @vaclav-dvorak, Action: `pull_request`*